Revit 2027 API
FailuresAccessor.IsFailureResolutionPermitted Method
 Checks if resolution of failures is permitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFailureResolutionPermitted()
Public Function IsFailureResolutionPermitted As Boolean
public:
bool IsFailureResolutionPermitted()
member IsFailureResolutionPermitted : unit -> bool
Return Value
Boolean
 True if resolutions of failures is permitted.
See Also
Reference
FailuresAccessor Class
IsFailureResolutionPermitted Overload
Autodesk.Revit.DB Namespace